cmsis-svd/cmsis-svd-data/data/Atmel/ATSAMD20E16B.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>TC0</name>
         <version>U22121.1.2</version>
         <description>Basic Timer Counter</description>
         <groupName>TC</groupName>
         <prependToName>TC_</prependToName>
         <baseAddress>0x42002000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x20</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>TC0</name>
            <description>Timer/Counter 0</description>
            <value>13</value>
         </interrupt>
         <registers>
            <cluster>
               <name>COUNT8</name>
               <description>8-bit Counter Mode</description>
               <headerStructName>TcCount8</headerStructName>
               <addressOffset>0x0</addressOffset>
               <register>
                  <name>CTRLA</name>
                  <description>Control A</description>
                  <addressOffset>0x0</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>SWRST</name>
                        <description>Software Reset</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENABLE</name>
                        <description>Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MODE</name>
                        <description>TC Mode</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>MODESelect</name>
                           <enumeratedValue>
                              <name>COUNT16</name>
                              <description>Counter in 16-bit mode</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>COUNT8</name>
                              <description>Counter in 8-bit mode</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>COUNT32</name>
                              <description>Counter in 32-bit mode</description>
                              <value>2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>WAVEGEN</name>
                        <description>Waveform Generation Operation</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>WAVEGENSelect</name>
                           <enumeratedValue>
                              <name>NFRQ</name>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MFRQ</name>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>NPWM</name>
                              <value>2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MPWM</name>
                              <value>3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>PRESCALER</name>
                        <description>Prescaler</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <name>PRESCALERSelect</name>
                           <enumeratedValue>
                              <name>DIV1</name>
                              <description>GCLK_TC</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV2</name>
                              <description>GCLK_TC/2</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV4</name>
                              <description>GCLK_TC/4</description>
                              <value>2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV8</name>
                              <description>GCLK_TC/8</description>
                              <value>3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV16</name>
                              <description>GCLK_TC/16</description>
                              <value>4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV64</name>
                              <description>GCLK_TC/64</description>
                              <value>5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV256</name>
                              <description>GCLK_TC/256</description>
                              <value>6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV1024</name>
                              <description>GCLK_TC/1024</description>
                              <value>7</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>RUNSTDBY</name>
                        <description>Run in Standby</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PRESCSYNC</name>
                        <description>Prescaler and Counter Synchronization</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>PRESCSYNCSelect</name>
                           <enumeratedValue>
                              <name>GCLK</name>
                              <description>Reload or reset Counter on next GCLK</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PRESC</name>
                              <description>Reload or reset Counter on next prescaler clock</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>RESYNC</name>
                              <description>Reload or reset Counter on next GCLK. Reset prescaler counter</description>
                              <value>2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>READREQ</name>
                  <description>Read Request</description>
                  <addressOffset>0x2</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>ADDR</name>
                        <description>Address</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>5</bitWidth>
                     </field>
                     <field>
                        <name>RCONT</name>
                        <description>Read Continuously</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RREQ</name>
                        <description>Read Request</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CTRLBCLR</name>
                  <description>Control B Clear</description>
                  <addressOffset>0x4</addressOffset>
                  <size>8</size>
                  <resetValue>0x02</resetValue>
                  <fields>
                     <field>
                        <name>DIR</name>
                        <description>Counter Direction</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ONESHOT</name>
                        <description>One-Shot</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CMD</name>
                        <description>Command</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>CMDSelect</name>
                           <enumeratedValue>
                              <name>NONE</name>
                              <description>No action</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>RETRIGGER</name>
                              <description>Force start, restart or retrigger</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>STOP</name>
                              <description>Force stop</description>
                              <value>2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CTRLBSET</name>
                  <description>Control B Set</description>
                  <addressOffset>0x5</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>DIR</name>
                        <description>Counter Direction</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ONESHOT</name>
                        <description>One-shot</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CMD</name>
                        <description>Command</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>CMDSelect</name>
                           <enumeratedValue>
                              <name>NONE</name>
                              <description>No action</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>RETRIGGER</name>
                              <description>Force start, restart or retrigger</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>STOP</name>
                              <description>Force stop</description>
                              <value>2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CTRLC</name>
                  <description>Control C</description>
                  <addressOffset>0x6</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>INVEN0</name>
                        <description>Output Waveform 0 Invert Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>INVEN1</name>
                        <description>Output Waveform 1 Invert Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CPTEN0</name>
                        <description>Capture Channel 0 Enable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CPTEN1</name>
                        <description>Capture Channel 1 Enable</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DBGCTRL</name>
                  <description>Debug Control</description>
                  <addressOffset>0x8</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>DBGRUN</name>
                        <description>Debug Run Mode</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>EVCTRL</name>
                  <description>Event Control</description>
                  <addressOffset>0xA</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>EVACT</name>
                        <description>Event Action</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <name>EVACTSelect</name>
                           <enumeratedValue>
                              <name>OFF</name>
                              <description>Event action disabled</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>RETRIGGER</name>
                              <description>Start, restart or retrigger TC on event</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>COUNT</name>
                              <description>Count on event</description>
                              <value>2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>START</name>
                              <description>Start TC on event</description>
                              <value>3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PPW</name>
                              <description>Period captured into CC0 Pulse Width in CC1</description>
                              <value>5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PWP</name>
                              <description>Period captured into CC1 Pulse Width on CC0</description>
                              <value>6</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>TCINV</name>
                        <description>TC Inverted Event Input</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TCEI</name>
                        <description>TC Event Input</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OVFEO</name>
                        <description>Overflow/Underflow Event Output Enable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MCEO0</name>
                        <description>Match or Capture Channel 0 Event Output Enable</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MCEO1</name>
                        <description>Match or Capture Channel 1 Event Output Enable</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTENCLR</name>
                  <description>Interrupt Enable Clear</description>
                  <addressOffset>0xC</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>OVF</name>
                        <description>Overflow Interrupt Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERR</name>
                        <description>Error Interrupt Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SYNCRDY</name>
                        <description>Synchronization Ready Interrupt Enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MC0</name>
                        <description>Match or Capture Channel 0 Interrupt Enable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MC1</name>
                        <description>Match or Capture Channel 1 Interrupt Enable</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTENSET</name>
                  <description>Interrupt Enable Set</description>
                  <addressOffset>0xD</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>OVF</name>
                        <description>Overflow Interrupt Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERR</name>
                        <description>Error Interrupt Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SYNCRDY</name>
                        <description>Synchronization Ready Interrupt Enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MC0</name>
                        <description>Match or Capture Channel 0 Interrupt Enable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MC1</name>
                        <description>Match or Capture Channel 1 Interrupt Enable</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
